In [1]:
import pandas as pd
import random

In [3]:
df_master = pd.read_csv("../data/customer_churn_records.csv")
df = df_master.copy()

In [4]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,SatisfactionScore,CardType,PointEarned
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1,1,2,DIAMOND,464
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,1,3,DIAMOND,456
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,1,3,DIAMOND,377
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0,5,GOLD,350
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0,5,GOLD,425

In [5]:
df_sample = df.sample(100)
df_sample.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,SatisfactionScore,CardType,PointEarned
160,161,15692132,Wilkinson,717,Spain,Female,22,6,101060.25,1,0,1,84699.56,0,0,2,GOLD,666
2236,2237,15712849,Tung,632,Germany,Male,41,3,126550.70,1,0,0,177644.52,1,1,3,PLATINUM,324
1332,1333,15796721,Nnamutaezinwa,778,France,Male,38,3,145018.49,2,1,1,126702.41,0,0,2,SILVER,598
2548,2549,15617197,Chien,524,France,Male,50,4,0.00,2,1,1,31840.59,1,1,2,SILVER,292
4876,4877,15585133,Wei,657,Spain,Female,27,8,0.00,2,0,0,6468.24,0,0,2,GOLD,354

In [6]:
df_with_only_features = df.drop(["RowNumber", "CustomerId", "Geography", "Surname", "Complain", "Exited"], axis=1)

In [7]:
df_with_only_features.head()

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,SatisfactionScore,CardType,PointEarned
0,619,Female,42,2,0.00,1,1,1,101348.88,2,DIAMOND,464
1,608,Female,41,1,83807.86,1,0,1,112542.58,3,DIAMOND,456
2,502,Female,42,8,159660.80,3,1,0,113931.57,3,DIAMOND,377
3,699,Female,39,1,0.00,2,0,0,93826.63,5,GOLD,350
4,850,Female,43,2,125510.82,1,1,1,79084.10,5,GOLD,425

In [16]:
for i in range(10):
    df_sample_1 = df_with_only_features.sample(100)
    df_sample_1.to_csv(f'../data/customers_file_{i+1}.csv', index=False)

In [9]:
test_file = pd.read_csv("../data/Folder A/customers_file_1.csv")
test_file.head(10)

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,SatisfactionScore,CardType,PointEarned
0,584,Male,31,5,0.00,2,1,0,31474.27,2,PLATINUM,568
1,850,Female,28,9,0.00,2,1,1,164864.67,4,GOLD,891
2,629,Female,37,10,99546.25,3,0,1,25136.95,1,PLATINUM,878
3,623,Male,42,1,149332.48,2,1,0,100834.22,4,DIAMOND,320
4,618,Male,42,8,153572.31,2,1,1,76679.60,3,DIAMOND,594
5,587,Female,39,6,101851.80,2,1,0,7103.71,2,DIAMOND,659
6,568,Male,28,5,145105.64,2,1,0,185489.11,5,GOLD,975
7,850,Female,27,8,111837.78,2,1,1,110805.79,1,GOLD,521
8,723,Male,30,3,124119.54,1,1,0,162198.32,4,PLATINUM,945
9,429,Male,24,4,95741.75,1,1,0,46170.75,2,GOLD,352

In [ ]:
def split_csv(input_file, output_folder, chunk_size=10):

    # Read the input CSV file
    df = pd.read_csv(input_file)
    df_final = df.drop(columns = ["RowNumber", "CustomerId", "Geography", "Surname", "Complain", "Exited"], axis =1)

    # Calculate the number of chunks
    num_chunks = len(df_final) // chunk_size + (1 if len(df) % chunk_size else 0)

    # Split and save the chunks
    for i in range(num_chunks):
        chunk = df_final[i * chunk_size:(i + 1) * chunk_size]
        chunk.to_csv(f"{output_folder}/chunk_{i+1}.csv", index=False)

# Replace with your file paths
split_csv("./customer_churn_records.csv", "../files")

In [16]:
def split_csv(df, output_folder, chunk_size=10):

    # Calculate the number of chunks
    num_chunks = len(df) // chunk_size + (1 if len(df) % chunk_size else 0)

    # Split and save the chunks, adding random errors to every second file
    for i in range(num_chunks):
        chunk = df[i * chunk_size:(i + 1) * chunk_size]

        # Add an error to every second file
        if i % 2 == 1:
            random_row = random.randint(0, chunk.shape[0] - 1)
            random_col = random.randint(0, chunk.shape[1] - 1)
            # Select a random error value
            error_value = random.choice([-9, 'null', 'Diamond', "They", -10000, "SHIT"])
            chunk.iloc[random_row, random_col] = error_value

        chunk.to_csv(f"{output_folder}/customers_file_{i+1}.csv", index=False)


split_csv(df_with_only_features, "../dsp-finalproject/data/Folder A")

/var/folders/nx/nd5hy9z92p18k3jpbyyqw3m80000gn/T/ipykernel_84827/1003651039.py:16: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'They' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  chunk.iloc[random_row, random_col] = error_value
/var/folders/nx/nd5hy9z92p18k3jpbyyqw3m80000gn/T/ipykernel_84827/1003651039.py:16: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Diamond' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  chunk.iloc[random_row, random_col] = error_value
/var/folders/nx/nd5hy9z92p18k3jpbyyqw3m80000gn/T/ipykernel_84827/1003651039.py:16: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'SHIT' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  chunk.iloc[random_row, random_col] = error_value
/var/folders/nx/nd5hy9z92p18k3jpbyyqw3m80000gn/T/ipykernel_84827/1003651039.py:16: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'null' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  chunk.iloc[random_row, random_col] = error_value
/var/folders/nx/nd5hy9z92p18k3jpbyyqw3m80000gn/T/ipykernel_84827/1003651039.py:16: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Diamond' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  chunk.iloc[random_row, random_col] = error_value
/var/folders/nx/nd5hy9z92p18k3jpbyyqw3m80000gn/T/ipykernel_84827/1003651039.py:16: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'They' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  chunk.iloc[random_row, random_col] = error_value
/var/folders/nx/nd5hy9z92p18k3jpbyyqw3m80000gn/T/ipykernel_84827/1003651039.py:16: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'SHIT' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  chunk.iloc[random_row, random_col] = error_value
/var/folders/nx/nd5hy9z92p18k3jpbyyqw3m80000gn/T/ipykernel_84827/1003651039.py:16: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'null' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  chunk.iloc[random_row, random_col] = error_value